cf_billing/AccumulationRegisters/бестВзаиморасчетыПоАвансовымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоАвансовымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоМесяцамЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоМесяцамЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестАвансыЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестАвансыЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежноеПоручениеВходящееЭЭЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестАвансыИспользованныеЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестАвансыИспользованныеЭЭ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежноеПоручениеВходящееЭЭЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоПениЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоПениЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестСписаннаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестСписаннаяЗадолженность</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СписаниеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестМораторнаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестМораторнаяЗадолженность</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/CommonModules/бестВзаиморасчетыЮрЛицаСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Получить задолженность по договору - 
// Получение объединения оборотов РН бестВзаиморасчетыПоАвансовымСчетам с остатками РН бестВзаиморасчетыПоМесяцамЭЭ
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации 
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ПериодНачисления - Дата 
//  Дата			 - Дата 
//  Договор			 - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьЗадолженностьПоДоговору(Организация, Район, ПериодНачисления, Дата, Договор) Экспорт
	ГраницыПериода  									= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	НачалоРасчета										= ГраницыПериода.НачалоОП;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаПриход - бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаРасход КАК Сумма,
		|	бестВзаиморасчетыПоАвансовымСчетамОбороты.ПлатежныйДокумент КАК ПлатежныйДокумент,
		|	бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаНДСПриход - бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаНДСРасход КАК СуммаНДС,
		|	бестВзаиморасчетыПоАвансовымСчетамОбороты.ПериодНачисления КАК ПериодНачисления
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоАвансовымСчетам.Обороты(
		|			&НачалоРасчета,
		|			&Дата,
		|			,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестВзаиморасчетыПоАвансовымСчетамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
		|		ПО бестВзаиморасчетыПоАвансовымСчетамОбороты.Организация = бестПлатежныйДокумент.Организация
		|			И бестВзаиморасчетыПоАвансовымСчетамОбороты.Район = бестПлатежныйДокумент.Район
		|			И бестВзаиморасчетыПоАвансовымСчетамОбороты.Договор = бестПлатежныйДокумент.Договор
		|			И бестВзаиморасчетыПоАвансовымСчетамОбороты.ПериодНачисления = бестПлатежныйДокумент.ПериодНачисления
		|			И (бестПлатежныйДокумент.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический))
		|			И (НЕ бестПлатежныйДокумент.ПометкаУдаления)
		|ГДЕ
		|	бестПлатежныйДокумент.Ссылка ЕСТЬ NULL
		|	И бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаПриход > бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаРасход
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.ПлатежныйДокумент,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаНДСОстаток,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.ПериодНачисления
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестВзаиморасчетыПоМесяцамЭЭОстатки
		|ГДЕ
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток > 0";
	
	Запрос.УстановитьПараметр("Дата", 			Дата + 1);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("НачалоРасчета", 	НачалоРасчета);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;	

КонецФункции

// Функция - Получить фактическую задолженность на дату
// Получение остатков из РН бестВзаиморасчетыПоМесяцамЭЭ
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности 
//  Период		 - Дата 
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьФактическуюЗадолженностьНаДату(Организация, Район, Период, Договор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток КАК Сумма,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаНДСОстаток КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестВзаиморасчетыПоМесяцамЭЭОстатки";
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период + 1);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Получить авансовую задолженность на дату
// Получение остатков из РН бестВзаиморасчетыПоАвансовымСчетам
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности 
//  Период		 - Дата 
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьАвансовуюЗадолженностьНаДату(Организация, Район, Период, Договор) Экспорт
	
	ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Период, Организация,Район);
	
	ГраницыПериода  									= Обработки.бестГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	НачалоРасчета										= ГраницыПериода.НачалоОП;
	КонецРасчета										= ГраницыПериода.ЗавершениеОП;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестВзаиморасчетыПоАвансовымСчетамОстатки.СуммаОстаток КАК Сумма,
		|	бестВзаиморасчетыПоАвансовымСчетамОстатки.СуммаНДСОстаток КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоАвансовымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестВзаиморасчетыПоАвансовымСчетамОстатки";
	
	Запрос.УстановитьПараметр("Договор", 			Договор);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Период", 	 		Период + 1);
	Запрос.УстановитьПараметр("Район", 				Район);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Получить переплату на дату
// Получение остатков из РН бестАвансыЭЭ
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности 
//  Период		 - Дата 
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьПереплатуНаДату(Организация, Район, Период, Договор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестАвансыЭЭОстатки.СуммаОстаток КАК Сумма,
		|	бестАвансыЭЭОстатки.СуммаНДСОстаток КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.бестАвансыЭЭ.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестАвансыЭЭОстатки";
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период + 1);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Оплаты СФ за период 
// Получение оплат с учетом исправлений, пени и оплат авансовых счетов (РН бестВзаиморасчетыПоМесяцамЭЭ,
// бестАвансыИспользованныеЭЭ, бестВзаиморасчетыПоПениЭЭ) 
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации 
//  Район			 - СправочникСсылка.энргЗоныОтвественности  
//  НачалоПериода	 - Дата 
//  КонецПериода	 - Дата 
//  Договор			 - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ОплатыСФЗаПериод(Организация, Район, НачалоПериода, КонецПериода, Договор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА бестВзаиморасчетыПоМесяцамЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА бестВзаиморасчетыПоМесяцамЭЭ.Сумма
		|		КОГДА бестВзаиморасчетыПоМесяцамЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА -бестВзаиморасчетыПоМесяцамЭЭ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаДолг,
		|	бестВзаиморасчетыПоМесяцамЭЭ.Регистратор КАК ДокИсправление,
		|	бестПлатежныйДокумент.НомерПД КАК НомерСФ,
		|	бестПлатежныйДокумент.Дата КАК ДатаСФ,
		|	0 КАК СуммаОплаты,
		|	бестПлатежныйДокумент.ДокументИсточник КАК ДокументИсточник
		|ПОМЕСТИТЬ Исправления
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ КАК бестВзаиморасчетыПоМесяцамЭЭ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
		|		ПО бестВзаиморасчетыПоМесяцамЭЭ.Регистратор = бестПлатежныйДокумент.Ссылка
		|			И (бестПлатежныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бестВидыОпераций.ПлатежныйДокумент_Исправление))
		|ГДЕ
		|	бестВзаиморасчетыПоМесяцамЭЭ.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И бестВзаиморасчетыПоМесяцамЭЭ.Организация = &Организация
		|	И бестВзаиморасчетыПоМесяцамЭЭ.Район = &Район
		|	И бестВзаиморасчетыПоМесяцамЭЭ.Договор = &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестАвансыИспользованныеЭЭ.Организация КАК Организация,
		|	бестАвансыИспользованныеЭЭ.Район КАК Район,
		|	бестАвансыИспользованныеЭЭ.Договор КАК Договор,
		|	бестАвансыИспользованныеЭЭ.ПериодРасчета КАК ПериодНачисления,
		|	СУММА(бестАвансыИспользованныеЭЭ.Сумма) КАК СуммаОборот
		|ПОМЕСТИТЬ ОплатаВАвансах
		|ИЗ
		|	РегистрНакопления.бестАвансыИспользованныеЭЭ КАК бестАвансыИспользованныеЭЭ
		|ГДЕ
		|	бестАвансыИспользованныеЭЭ.Организация = &Организация
		|	И бестАвансыИспользованныеЭЭ.Район = &Район
		|	И бестАвансыИспользованныеЭЭ.Договор = &Договор
		|	И бестАвансыИспользованныеЭЭ.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	бестАвансыИспользованныеЭЭ.Организация,
		|	бестАвансыИспользованныеЭЭ.Район,
		|	бестАвансыИспользованныеЭЭ.Договор,
		|	бестАвансыИспользованныеЭЭ.ПериодРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА бестВзаиморасчетыПоМесяцамЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА бестВзаиморасчетыПоМесяцамЭЭ.Сумма
		|		КОГДА бестВзаиморасчетыПоМесяцамЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И НЕ бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА -бестВзаиморасчетыПоМесяцамЭЭ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаДолг,
		|	бестВзаиморасчетыПоМесяцамЭЭ.ПлатежныйДокумент КАК ПлатежныйДокумент,
		|	ВЫБОР
		|		КОГДА бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента, бестПлатежныйДокумент.Дата)
		|	КОНЕЦ КАК ДатаОплаты,
		|	ВЫБОР
		|		КОГДА бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.НомерПлатежногоДокумента, бестПлатежныйДокумент.НомерПД)
		|	КОНЕЦ КАК НомерОплаты,
		|	бестПлатежныйДокумент.НомерПД КАК НомерСФ,
		|	ЕСТЬNULL(бестПлатежныйДокумент.Дата, бестКорректировкаЗадолженности.Дата) КАК ДатаСФ,
		|	бестВзаиморасчетыПоМесяцамЭЭ.ПериодНачисления КАК ПериодНачисления,
		|	ВЫБОР
		|		КОГДА бестВзаиморасчетыПоМесяцамЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА бестВзаиморасчетыПоМесяцамЭЭ.Сумма
		|		КОГДА бестВзаиморасчетыПоМесяцамЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА -бестВзаиморасчетыПоМесяцамЭЭ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаОплаты,
		|	бестПлатежныйДокумент.ДокументИсточник КАК ДокументИсточник
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ КАК бестВзаиморасчетыПоМесяцамЭЭ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
		|		ПО бестВзаиморасчетыПоМесяцамЭЭ.ПлатежныйДокумент = бестПлатежныйДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
		|		ПО бестВзаиморасчетыПоМесяцамЭЭ.IDСтрокиОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки
		|			И бестВзаиморасчетыПоМесяцамЭЭ.Регистратор = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестВзаиморасчетыПоМесяцамЭЭ.Регистратор = бестКорректировкаЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокументРегистратор
		|		ПО бестВзаиморасчетыПоМесяцамЭЭ.Регистратор = бестПлатежныйДокументРегистратор.Ссылка
		|ГДЕ
		|	бестВзаиморасчетыПоМесяцамЭЭ.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И бестВзаиморасчетыПоМесяцамЭЭ.Организация = &Организация
		|	И бестВзаиморасчетыПоМесяцамЭЭ.Район = &Район
		|	И бестВзаиморасчетыПоМесяцамЭЭ.Договор = &Договор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ бестПлатежныйДокумент.Ссылка ЕСТЬ NULL
		|			ТОГДА бестАвансыИспользованныеЭЭОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	бестПлатежныйДокумент.Ссылка,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.НомерПлатежногоДокумента,
		|	бестПлатежныйДокумент.НомерПД,
		|	ЕСТЬNULL(бестПлатежныйДокумент.Дата, бестКорректировкаЗадолженности.Дата),
		|	бестАвансыИспользованныеЭЭОбороты.ПериодНачисления,
		|	ВЫБОР
		|		КОГДА НЕ бестПлатежныйДокумент.Ссылка ЕСТЬ NULL
		|			ТОГДА ОплатаВАвансах.СуммаОборот
		|		ИНАЧЕ -бестАвансыИспользованныеЭЭОбороты.СуммаОборот
		|	КОНЕЦ,
		|	бестПлатежныйДокумент.ДокументИсточник
		|ИЗ
		|	РегистрНакопления.бестАвансыИспользованныеЭЭ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестАвансыИспользованныеЭЭОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
		|		ПО бестАвансыИспользованныеЭЭОбороты.Регистратор = бестПлатежныйДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
		|		ПО бестАвансыИспользованныеЭЭОбороты.ДокументОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка
		|			И бестАвансыИспользованныеЭЭОбороты.IDСтрокиОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестАвансыИспользованныеЭЭОбороты.Регистратор = бестКорректировкаЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатаВАвансах КАК ОплатаВАвансах
		|		ПО бестАвансыИспользованныеЭЭОбороты.Организация = ОплатаВАвансах.Организация
		|			И бестАвансыИспользованныеЭЭОбороты.Район = ОплатаВАвансах.Район
		|			И бестАвансыИспользованныеЭЭОбороты.Договор = ОплатаВАвансах.Договор
		|			И бестАвансыИспользованныеЭЭОбороты.ПериодНачисления = ОплатаВАвансах.ПериодНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА бестВзаиморасчетыПоПениЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА бестВзаиморасчетыПоПениЭЭ.Сумма
		|		КОГДА бестВзаиморасчетыПоПениЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И НЕ бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА -бестВзаиморасчетыПоПениЭЭ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	бестВзаиморасчетыПоПениЭЭ.ПлатежныйДокумент,
		|	ВЫБОР
		|		КОГДА бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента, бестПлатежныйДокумент.Дата)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.НомерПлатежногоДокумента, бестПлатежныйДокумент.НомерПД)
		|	КОНЕЦ,
		|	бестПлатежныйДокумент.НомерПД,
		|	ЕСТЬNULL(бестПлатежныйДокумент.Дата, бестКорректировкаЗадолженности.Дата),
		|	бестВзаиморасчетыПоПениЭЭ.ПериодНачисления,
		|	ВЫБОР
		|		КОГДА бестВзаиморасчетыПоПениЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА бестВзаиморасчетыПоПениЭЭ.Сумма
		|		КОГДА бестВзаиморасчетыПоПениЭЭ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И бестПлатежныйДокументРегистратор.Ссылка ЕСТЬ NULL
		|			ТОГДА -бестВзаиморасчетыПоПениЭЭ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	бестПлатежныйДокумент.ДокументИсточник
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ КАК бестВзаиморасчетыПоПениЭЭ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
		|		ПО бестВзаиморасчетыПоПениЭЭ.ПлатежныйДокумент = бестПлатежныйДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
		|		ПО бестВзаиморасчетыПоПениЭЭ.IDСтрокиОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки
		|			И бестВзаиморасчетыПоПениЭЭ.Регистратор = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестКорректировкаЗадолженности КАК бестКорректировкаЗадолженности
		|		ПО бестВзаиморасчетыПоПениЭЭ.Регистратор = бестКорректировкаЗадолженности.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокументРегистратор
		|		ПО бестВзаиморасчетыПоПениЭЭ.Регистратор = бестПлатежныйДокументРегистратор.Ссылка
		|ГДЕ
		|	бестВзаиморасчетыПоПениЭЭ.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И бестВзаиморасчетыПоПениЭЭ.Организация = &Организация
		|	И бестВзаиморасчетыПоПениЭЭ.Район = &Район
		|	И бестВзаиморасчетыПоПениЭЭ.Договор = &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.СуммаДолг + ЕСТЬNULL(Исправления.СуммаДолг, 0) КАК СуммаДолг,
		|	Итог.ПлатежныйДокумент КАК ПлатежныйДокумент,
		|	Итог.ДатаОплаты КАК ДатаОплаты,
		|	Итог.НомерОплаты КАК НомерОплаты,
		|	Итог.НомерСФ КАК НомерСФ,
		|	Итог.ДатаСФ КАК ДатаСФ,
		|	Итог.ПериодНачисления КАК ПериодНачисления,
		|	Итог.СуммаОплаты + ЕСТЬNULL(Исправления.СуммаОплаты, 0) КАК СуммаОплаты,
		|	ЕСТЬNULL(Исправления.ДокИсправление, Итог.ДокументИсточник) КАК ДокументИсточник
		|ИЗ
		|	Итог КАК Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ Исправления КАК Исправления
		|		ПО Итог.ПлатежныйДокумент = Исправления.ДокументИсточник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСФ
		|ИТОГИ
		|	СУММА(СуммаДолг),
		|	МАКСИМУМ(НомерСФ),
		|	МАКСИМУМ(ДатаСФ),
		|	МАКСИМУМ(ПериодНачисления),
		|	СУММА(СуммаОплаты),
		|	МАКСИМУМ(ДокументИсточник)
		|ПО
		|	ПлатежныйДокумент";
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();

КонецФункции

// Функция - Получить расшифровку авансов за период 
// Получение авансов фактических и авансов по авансовым счетам (РН бестВзаиморасчетыПоАвансовымСчетам, бестАвансыЭЭ) 
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации 
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  НачалоПериода	 - Дата 
//  КонецПериода	 - Дата 
//  Договор			 - СправочникСсылка.энргДоговорыКонтрагентов
// 
// Возвращаемое значение:
//   Структура - с ключами "Авансы" и "Переплаты" с типами РезультатЗапроса 
//
Функция ПолучитьРасшифровкуАвансовЗаПериод(Организация, Район, НачалоПериода, КонецПериода, Договор) Экспорт
	
	НачалоПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(НачалоПериода, Организация,Район);
	КонецПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(КонецПериода, Организация,Район);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.НомерПлатежногоДокумента КАК НомерОплаты,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента КАК ДатаОплаты,
		|	бестАвансыЭЭОстатки.СуммаОстаток КАК СуммаОплаты,
		|	бестАвансыЭЭОстатки.СуммаНДСОстаток КАК СуммаОплатыНДС,
		|	бестАвансыЭЭОстатки.ДокументОплаты КАК ДокументОплаты,
		|	бестАвансыЭЭОстатки.IDСтрокиОплаты КАК IDСтрокиОплаты
		|ПОМЕСТИТЬ Переплаты
		|ИЗ
		|	РегистрНакопления.бестАвансыЭЭ.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор
		|				И ПериодНачисления >= &НачалоПериодНачисления
		|				И ПериодНачисления <= &КонецПериодНачисления) КАК бестАвансыЭЭОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
		|		ПО бестАвансыЭЭОстатки.ДокументОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка
		|			И бестАвансыЭЭОстатки.IDСтрокиОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки
		|ГДЕ
		|	бестАвансыЭЭОстатки.СуммаОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.НомерПлатежногоДокумента КАК НомерОплаты,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента КАК ДатаОплаты,
		|	СУММА(бестВзаиморасчетыПоАвансовымСчетам.Сумма) КАК Сумма,
		|	СУММА(бестВзаиморасчетыПоАвансовымСчетам.СуммаНДС) КАК СуммаНДС,
		|	бестВзаиморасчетыПоАвансовымСчетам.Регистратор КАК ДокументОплаты,
		|	бестВзаиморасчетыПоАвансовымСчетам.IDСтрокиОплаты КАК IDСтрокиОплаты
		|ПОМЕСТИТЬ Авансы
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоАвансовымСчетам КАК бестВзаиморасчетыПоАвансовымСчетам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежноеПоручениеВходящееЭЭЮрЛица.Оплата КАК бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата
		|		ПО бестВзаиморасчетыПоАвансовымСчетам.Регистратор = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.Ссылка
		|			И бестВзаиморасчетыПоАвансовымСчетам.IDСтрокиОплаты = бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.IDСтроки
		|			И (бестВзаиморасчетыПоАвансовымСчетам.Организация = &Организация)
		|			И (бестВзаиморасчетыПоАвансовымСчетам.Район = &Район)
		|			И (бестВзаиморасчетыПоАвансовымСчетам.Договор = &Договор)
		|			И (бестВзаиморасчетыПоАвансовымСчетам.ПериодНачисления >= &НачалоПериодНачисления)
		|			И (бестВзаиморасчетыПоАвансовымСчетам.ПериодНачисления <= &КонецПериодНачисления)
		|			И (бестВзаиморасчетыПоАвансовымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|
		|СГРУППИРОВАТЬ ПО
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.ДатаПлатежногоДокумента,
		|	бестПлатежноеПоручениеВходящееЭЭЮрЛицаОплата.НомерПлатежногоДокумента,
		|	бестВзаиморасчетыПоАвансовымСчетам.Регистратор,
		|	бестВзаиморасчетыПоАвансовымСчетам.IDСтрокиОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Переплаты.НомерОплаты КАК НомерОплаты,
		|	Переплаты.ДатаОплаты КАК ДатаОплаты,
		|	Переплаты.СуммаОплаты - ЕСТЬNULL(Авансы.Сумма, 0) КАК СуммаОплаты,
		|	Переплаты.СуммаОплатыНДС - ЕСТЬNULL(Авансы.СуммаНДС, 0) КАК СуммаОплатыНДС
		|ИЗ
		|	Переплаты КАК Переплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Авансы КАК Авансы
		|		ПО Переплаты.ДокументОплаты = Авансы.ДокументОплаты
		|			И Переплаты.IDСтрокиОплаты = Авансы.IDСтрокиОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Авансы.НомерОплаты КАК НомерОплаты,
		|	Авансы.ДатаОплаты КАК ДатаОплаты,
		|	Авансы.Сумма КАК Сумма,
		|	Авансы.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Авансы КАК Авансы";
	
	Запрос.УстановитьПараметр("Договор", 					Договор);
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("Период", 					КонецПериода + 1);
	Запрос.УстановитьПараметр("НачалоПериодНачисления", 	НачалоПериодНачисления);
	Запрос.УстановитьПараметр("КонецПериодНачисления", 		КонецПериодНачисления);
	Запрос.УстановитьПараметр("Район", 						Район);
	Пакет = Запрос.ВыполнитьПакет();
	ИндексПоследнегоПакета = Пакет.ВГраница();
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Авансы", Пакет.Получить(ИндексПоследнегоПакета));
	СтруктураВозврата.Вставить("Переплаты", Пакет.Получить(ИндексПоследнегоПакета - 1));
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Получить пеню на дату 
// Получение остатков из РН бестВзаиморасчетыПоПениЭЭ
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности 
//  Период		 - Дата 
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьПенюНаДату(Организация, Район, Период, Договор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(бестВзаиморасчетыПоПениЭЭОстатки.СуммаОстаток) КАК Сумма,
		|	СУММА(бестВзаиморасчетыПоПениЭЭОстатки.СуммаНДСОстаток) КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор) КАК бестВзаиморасчетыПоПениЭЭОстатки";
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период + 1);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Получить фактическую задолженность по периодам
// Получение остатков из РН бестВзаиморасчетыПоМесяцамЭЭ с возможностью отбора по Срезу или по Периоду
// начисления (ПериодНачало, ПериодКонец)
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности  
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
//  ПериодНачало - Дата
//  ПериодКонец	 - Дата 
//  ПериодСрез	 - Дата
//  ВключатьГраницу	 - Булево 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьФактическуюЗадолженностьПоПериодам(Организация, Район, Договор ,ПериодНачало = Неопределено, 
		ПериодКонец = Неопределено, ПериодСрез = Неопределено, ВключатьГраницу = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.ПериодНачисления КАК ПериодНачисления,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток КАК Задолженность,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.ПлатежныйДокумент КАК ПлатежныйДокумент,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаНДСОстаток КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
		|			&ПериодСрез,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор
		|				И (ПериодНачисления МЕЖДУ &ПериодНачало И &ПериодКонец)) КАК бестВзаиморасчетыПоМесяцамЭЭОстатки";
	
	Если ПериодСрез = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодСрез", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ПериодНачисления МЕЖДУ &ПериодНачало И &ПериодКонец)", "ИСТИНА"); 
		Если ВключатьГраницу Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестВзаиморасчетыПоМесяцамЭЭОстатки.ПериодНачисления КАК ПериодНачисления,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестВзаиморасчетыПоМесяцамЭЭОстатки.ПлатежныйДокумент КАК ПлатежныйДокумент,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Задолженность", "Сумма"); 
		КонецЕсли;
	КонецЕсли;
	
	Граница = Новый Граница(ПериодСрез, ?(ВключатьГраницу, ВидГраницы.Включая, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ПериодКонец", 	ПериодКонец);
	Запрос.УстановитьПараметр("ПериодНачало", 	ПериодНачало);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("ПериодСрез",	 	Граница);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Получить пеню по периодам 
// Получение остатков из РН бестВзаиморасчетыПоПениЭЭ с возможностью отбора по Срезу или по Периоду
// начисления (ПериодНачало, ПериодКонец)
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности 
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов
//  ПериодНачало - Дата 
//  ПериодКонец	 - Дата
//  ПериодСрез	 - Дата 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьПенюПоПериодам(Организация, Район, Договор ,ПериодНачало = Неопределено, ПериодКонец = Неопределено, ПериодСрез = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестВзаиморасчетыПоПениЭЭ.ПериодНачисления КАК ПериодНачисления,
		|	бестВзаиморасчетыПоПениЭЭ.СуммаОстаток КАК Задолженность,
		|	бестВзаиморасчетыПоПениЭЭ.ПлатежныйДокумент КАК ПлатежныйДокумент,
		|	бестВзаиморасчетыПоПениЭЭ.СуммаНДСОстаток КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ.Остатки(
		|			&ПериодСрез,
		|			Организация = &Организация
		|				И Район = &Район
		|				И Договор = &Договор
		|				И (ПериодНачисления МЕЖДУ &ПериодНачало И &ПериодКонец)) КАК бестВзаиморасчетыПоПениЭЭ";
	
	Если ПериодСрез = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодСрез", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ПериодНачисления МЕЖДУ &ПериодНачало И &ПериодКонец)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ПериодКонец", 	ПериодКонец);
	Запрос.УстановитьПараметр("ПериодНачало", 	ПериодНачало);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("ПериодСрез",	 	ПериодСрез);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Получить списанную задолженность
// Получение оборотов на дату из РН бестСписаннаяЗадолженность
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
//  Период		 - Дата 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьСписаннуюЗадолженность(Организация, Район, Договор, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	бестСписаннаяЗадолженностьОбороты.Организация КАК Организация,
		 |	бестСписаннаяЗадолженностьОбороты.Район КАК Район,
		 |	бестСписаннаяЗадолженностьОбороты.Договор КАК Договор,
		 |	бестСписаннаяЗадолженностьОбороты.ПериодНачисления КАК ПериодНачисления,
		 |	бестСписаннаяЗадолженностьОбороты.ПлатежныйДокумент КАК ПлатежныйДокумент,
		 |	бестСписаннаяЗадолженностьОбороты.СписаниеПени КАК СписаниеПени,
		 |	бестСписаннаяЗадолженностьОбороты.СуммаОборот КАК Сумма,
		 |	бестСписаннаяЗадолженностьОбороты.СуммаНДСОборот КАК СуммаНДС
		 |ИЗ
		 |	РегистрНакопления.бестСписаннаяЗадолженность.Обороты(
		 |			,
		 |			&Период,
		 |			,
		 |			Организация = &Организация
		 |				И Район = &Район
		 |				И Договор = &Договор) КАК бестСписаннаяЗадолженностьОбороты";
	
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период + 1);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Получить мораторную задолженность
// Получение оборотов на дату из РН бестМораторнаяЗадолженность
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
//  Период		 - Дата 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьМораторнуюЗадолженность(Организация, Район, Договор, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	бестМораторнаяЗадолженностьОбороты.Организация КАК Организация,
		 |	бестМораторнаяЗадолженностьОбороты.Район КАК Район,
		 |	бестМораторнаяЗадолженностьОбороты.Договор КАК Договор,
		 |	бестМораторнаяЗадолженностьОбороты.ПериодНачисления КАК ПериодНачисления,
		 |	бестМораторнаяЗадолженностьОбороты.ПлатежныйДокумент КАК ПлатежныйДокумент,
		 |	бестМораторнаяЗадолженностьОбороты.СуммаОборот КАК Сумма,
		 |	бестМораторнаяЗадолженностьОбороты.СуммаНДСОборот КАК СуммаНДС
		 |ИЗ
		 |	РегистрНакопления.бестМораторнаяЗадолженность.Обороты(
		 |			,
		 |			&Период,
		 |			,
		 |			Организация = &Организация
		 |				И Район = &Район
		 |				И Договор = &Договор) КАК бестМораторнаяЗадолженностьОбороты";
	
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период + 1);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();
КонецФункции

// Функция - Получить реструктуризированную задолженность
// Получение оборотов на дату из РН бестРеструктуризированнаяЗадолженность
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности
//  Договор		 - СправочникСсылка.энргДоговорыКонтрагентов 
//  Период		 - Дата 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ПолучитьРеструктуризированнуюЗадолженность(Организация, Район, Договор, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	бестРеструктуризированнаяЗадолженностьОбороты.Организация КАК Организация,
		 |	бестРеструктуризированнаяЗадолженностьОбороты.Район КАК Район,
		 |	бестРеструктуризированнаяЗадолженностьОбороты.Договор КАК Договор,
		 |	бестРеструктуризированнаяЗадолженностьОбороты.ПериодНачисления КАК ПериодНачисления,
		 |	бестРеструктуризированнаяЗадолженностьОбороты.ПлатежныйДокумент КАК ПлатежныйДокумент,
		 |	бестРеструктуризированнаяЗадолженностьОбороты.СуммаОборот КАК Сумма
		 |ИЗ
		 |	РегистрНакопления.бестРеструктуризированнаяЗадолженность.Обороты(
		 |			,
		 |			&Период,
		 |			,
		 |			Организация = &Организация
		 |				И Район = &Район
		 |				И Договор = &Договор) КАК бестРеструктуризированнаяЗадолженностьОбороты";
	
	
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период + 1);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();
КонецФункции

// Процедура - Запустить создание ПД
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации 
//  Район		 - СправочникСсылка.энргЗоныОтвественности
//
Процедура ЗапуститьСозданиеПД(Организация, Район) Экспорт 
	
	Обработки.бестФормированиеПлатежныхДокументов.СоздатьПД(Новый Структура("Организация,Район"),Организация, Район);
	
КонецПроцедуры

// Функция - Получить задолженность по ПД
// Получение задолженности по платежным документам
//
// Параметры:
//  Организация			 - СправочникСсылка.Организации 
//  Район				 - СправочникСсылка.энргЗоныОтвественности 
//  мДокументНачисления	 - Массив - Массив элементов с типом ДокументСсылка.бестПлатежныйДокумент
//  Период				 - Дата 
// 
// Возвращаемое значение:
//   Соответствие 
//
Функция ПолучитьЗадолженностьПоПД(Организация, Район, мДокументНачисления, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток КАК СуммаОстаток,
		|	бестВзаиморасчетыПоМесяцамЭЭОстатки.ПлатежныйДокумент КАК ПлатежныйДокумент
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ПлатежныйДокумент <> ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.ПустаяСсылка)
		|				И ПлатежныйДокумент В (&ПлатежныйДокумент)) КАК бестВзаиморасчетыПоМесяцамЭЭОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бестВзаиморасчетыПоАвансовымСчетамОстатки.СуммаОстаток,
		|	бестВзаиморасчетыПоАвансовымСчетамОстатки.ПлатежныйДокумент
		|ИЗ
		|	РегистрНакопления.бестВзаиморасчетыПоАвансовымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ПлатежныйДокумент <> ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.ПустаяСсылка)
		|				И ПлатежныйДокумент В (&ПлатежныйДокумент)) КАК бестВзаиморасчетыПоАвансовымСчетамОстатки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ПлатежныйДокумент", мДокументНачисления);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеЗадолженности = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеЗадолженности.Вставить(ВыборкаДетальныеЗаписи.ПлатежныйДокумент,
			ВыборкаДетальныеЗаписи.СуммаОстаток);
	КонецЦикла;
	
	Возврат СоответствиеЗадолженности;
КонецФункции

#Область РегламетныеПроцедуры

// Процедура - Регламентное создание ПД
//
Процедура РегламентноеСозданиеПД() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗоныОтвественности.Ссылка КАК Район,
		|	энргЗоныОтвественности.Организация КАК Организация
		|ИЗ
		|	Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
		|ГДЕ
		|	НЕ энргЗоныОтвественности.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыЗадания  			= Новый Массив;
		ПараметрыЗадания.Добавить(Выборка.Организация);
		ПараметрыЗадания.Добавить(Выборка.Район);
		ФоновыеЗадания.Выполнить("бестВзаиморасчетыЮрЛицаСервер.ЗапуститьСозданиеПД",ПараметрыЗадания);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
